build/test-results/test/TEST-Nombre#20de#20moneda.xml

<?xml version="1.0" encoding="UTF-8"?>
<testsuite name="Nombre de moneda" tests="1" skipped="0" failures="0" errors="0" timestamp="2022-03-26T02:19:41" hostname="juan-Forward-Unto-Dawn" time="0.795">
  <properties/>
  <testcase name="Convertir de moneda ISO a nombre formal" classname="Nombre de moneda" time="0.795"/>
  <system-out><![CDATA[2022-03-25 21:19:41 INFO  ConvertCurrencyNameTestStepDefinition:44 <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.oorsprong.org/websamples.countryinfo">
    <soapenv:Header/>
    <soapenv:Body>
        <web:CurrencyName>
            <web:sCurrencyISOCode>COP</web:sCurrencyISOCode>
        </web:CurrencyName>
    </soapenv:Body>
</soapenv:Envelope>

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <m:CurrencyNameResponse xmlns:m="http://www.oorsprong.org/websamples.countryinfo">
      <m:CurrencyNameResult>Pesos</m:CurrencyNameResult>
    </m:CurrencyNameResponse>
  </soap:Body>
</soap:Envelope>
]]></system-out>
  <system-err><![CDATA[]]></system-err>
</testsuite>
